//calc your pace
function calcPace(distance, time) {
    return time / distance;
};

//отставание от личного рекорда на этой дистанции
function diffPersonalBest(distance, currentTime) {

}

//отставание от лидера на этом соревновании


//отставание от следующего разряда


//отставание от рекорда России на этой дистанции


//отставание от мирового рекорда на этой дистанции


//отставание от олимпийского рекорда на этой дистанции


//отставание от рекорда сезона на этой дистанции


//получить таблицу разрядов для этой дистанции


//получить таблицу рекордов для этой дистанции